{
  "content": {
    "ar": "منصة آرام هى منصة بطاقات رقمية ذكية حيث توفر البطاقة لحاملها العديد من المميزات ولكل بطاقة مميزات منفصلة عن الاخرى.\n\nالمستخدم يستطيع امتلاك البطاقة بثلاث طرق مختلفة:\n1- الشراء المباشر للبطاقة\n2- الحصول على كوبون خاص ببطاقة مجانية (هناك كوبونات لإعطاء خصم على المبلغ أيضًا)\n3- الحصول على كوبون من مركز ضمن مراكز المنصة كعملية ترويجية من جهة المنصة والمركز معا\n\nجميع البطاقات لها فترة سريان محددة تبدأ بشكل تلقائي من وقت امتلاك البطاقة.\n\nالمنصة تحتوى على تعدد حسابات:\n1- حسابات مستخدمين\n2- حسابات مراكز\n3- حسابات مدراء\nكل حساب له صلاحيات خاصة به.\n\nالمنصة تحتوى على نظام حجوزات بحيث يمكن للمستخدم حجز موعد لدى مركز مفعل ميزة قبول الحجوزات.\nعند إرسال الحجز، يستطيع المستخدم التحكم فيه من خلال الإلغاء أو الحذف، والمركز يمكنه قبول أو رفض الحجز.\n\nالمنصة تحتوى على قسم خاص بالعروض المقدمة من المراكز بحيث يمكن للمستخدمين الاستفادة من هذه العروض.\nالمركز يستطيع إدارة العروض من لوحة التحكم الخاصة به.\n\nالمنصة تحتوى على نظام خدمات خاصة بكل خدمة مع إمكانية تتبع كل خطوة وتحديثها، مع دعم إرسال ملفات مختلفة.\nهناك ثلاث أنواع من الخدمات:\n1- خدمات باشتراك شهري\n2- خدمات شراء مباشر\n3- خدمات يتم الدفع فيها بعد الاتفاق\n\nالمنصة تحتوى على صفحة خاصة بالمدونة مع التحكم الكامل بالمقالات وإمكانية التفاعل والكتابة.\n\nكل مركز داخل المنصة يملك صفحة عامة و لوحة تحكم لإدارة بياناته، الحجوزات، العروض، الكوبونات، البطاقات المملوكة، محفظة الرصيد، وقائمة الطلبات.\n\nكل مستخدم لديه لوحة تحكم لإدارة بياناته الشخصية، الحجوزات، البطاقات المملوكة، المحادثات، محفظة الرصيد، أفراد العائلة، وإحصائيات المروج إذا كان مسموح له بذلك.\n\nلوحة تحكم المالك تشمل:\n- الصفحة الرئيسية مع أبرز الإحصائيات.\n- التحكم الكامل في محتوى الأقسام.\n- إدارة المستخدمين، المروجين، الأقسام، المراكز، البطاقات، العروض، الكوبونات، المقالات، الإشعارات، صفحات الخصوصية والشروط والأحكام، الحسابات الاجتماعية، العملات، الشكاوى، الأسئلة الشائعة، النشرة البريدية، روابط النهاية.\n\nالمنصة تدعم إشعارات الوقت الفعلي ونظام محادثة متقدم لنصوص، صور، ملفات، وصوت.\n\nالتقنيات المستخدمة:\nFront-end: Next.js, TypeScript, Tailwind CSS, Framer Motion, Swiper, Redux Toolkit, Axios, next-intl, Leaflet, Recharts, Pusher, Zod, date-fns, Sharp.\nBack-end: Laravel, PHP 8.2, Laravel Sanctum, Laravel Socialite, Laravel Scout + Meilisearch, Pusher, Intervention Image, Flysystem Google Drive, Spatie Laravel Backup, Guzzle HTTP Factory, Laravel Sail, Laravel Breeze, Pest, Laravel Pint, Laravel Tinker, Laravel Pail, MySQL.",
    "en": "Aram Platform is a smart digital card platform that provides its cardholders with many features, and each card has features separate from the others.\n\nThe user can obtain the card in three different ways:\n1- Direct purchase of the card\n2- Obtaining a coupon for a free card (there are also coupons to give a discount on the amount)\n3- Obtaining a coupon from a center within the platform's centers as a promotional activity by both the platform and the center\n\nAll cards have a specific validity period that starts automatically from the time of obtaining the card.\n\nThe platform contains multiple accounts:\n1- User accounts\n2- Center accounts\n3- Manager accounts\nEach account has its own permissions.\n\nThe platform contains a reservation system so that the user can book an appointment at a center that has enabled the reservation feature.\nWhen the reservation is sent, the user can control it by canceling or deleting it, and the center can accept or reject the reservation.\n\nThe platform contains a section for offers provided by the centers so that users can benefit from these offers.\nThe center can manage offers from its control panel.\n\nThe platform contains a service system for each service with the ability to track and update each step, with support for sending different files.\nThere are three types of services:\n1- Monthly subscription services\n2- Direct purchase services\n3- Services paid for after agreement\n\nThe platform contains a blog section with full control over articles and the ability to interact and write.\n\nEach center within the platform has a public page and a control panel to manage its data, reservations, offers, coupons, owned cards, balance wallet, and order list.\n\nEach user has a control panel to manage their personal data, reservations, owned cards, conversations, balance wallet, family members, and promoter statistics if allowed.\n\nThe owner's control panel includes:\n- The main page with the most important statistics.\n- Full control over section content.\n- Management of users, promoters, sections, centers, cards, offers, coupons, articles, notifications, privacy policy and terms and conditions pages, social accounts, currencies, complaints, frequently asked questions, newsletter, footer links.\n\nThe platform supports real-time notifications and an advanced chat system for text, images, files, and audio.\n\nTechnologies used:\nFront-end: Next.js, TypeScript, Tailwind CSS, Framer Motion, Swiper, Redux Toolkit, Axios, next-intl, Leaflet, Recharts, Pusher, Zod, date-fns, Sharp.\nBack-end: Laravel, PHP 8.2, Laravel Sanctum, Laravel Socialite, Laravel Scout + Meilisearch, Pusher, Intervention Image, Flysystem Google Drive, Spatie Laravel Backup, Guzzle HTTP Factory, Laravel Sail, Laravel Breeze, Pest, Laravel Pint, Laravel Tinker, Laravel Pail, MySQL."
  }
}
