{
  "content": {
    "ar": "أكاديمية بورسان هي منصة ويب تعليمية حديثة تهدف إلى عرض واستكشاف الدورات التعليمية ضمن تصنيفات متعددة، مع التركيز على الأداء العالي وتجربة المستخدم وقابلية التوسع، وتوفير واجهة استخدام واضحة وسلسة للمستخدمين.\n______________________________\nالمنصة تحتوي على واجهة تعليمية تفاعلية تتيح للمستخدم تصفح الدورات، استعراض تفاصيل كل دورة، والتنقل بين الأقسام المختلفة بطريقة منظمة ومتجاوبة مع جميع الأجهزة.\n______________________________\nالمنصة تدعم تعدد اللغات حيث توفر واجهتين باللغتين العربية والإنجليزية، من خلال نظام مخصص بالكامل لإدارة النصوص والترجمة دون الاعتماد على أي مكتبات خارجية.\n______________________________\nالمنصة تعتمد على تصميم متجاوب وحديث مع الاهتمام بالحركات والانتقالات البصرية لتحسين تجربة الاستخدام.\nالمنصة تحتوي على نظام تفاعل في الوقت الفعلي لدعم التحديثات الفورية داخل الواجهة عند الحاجة.\nالمنصة تم بناؤها باستخدام أحدث التقنيات في مجال الواجهات الأمامية مع مراعاة الأداء والأمان وقابلية التطوير المستقبلي.\n______________________________\nالتقنيات المستخدمة في بناء المنصة:\nتقنيات (Front-end):\nFramework: Next.js\nلغة البرمجة: TypeScript\nتنسيق الواجهة (Styling): Tailwind CSS\nإدارة النماذج: @tailwindcss/forms\nالحركات والانتقالات: Framer Motion\nSliders وCarousels: Swiper\nالتحديثات الفورية: Pusher\nAuthentication: Clerk\nPayments Integration: Stripe\nالتعامل مع الـ API: Axios\nإدارة الكوكيز: cookie-universal\nتحسين الصور: Sharp\n______________________________\nالمنصة حاليًا عبارة عن مشروع Front-end فقط، ومهيأة للتكامل مع أي نظام Back-end مستقبلي عند الحاجة.",
    "en": "Borsan Academy is a modern web educational platform aimed at displaying and exploring educational courses across multiple categories, focusing on high performance, user experience, scalability, and providing a clear and smooth user interface.\n______________________________\nThe platform includes an interactive learning interface allowing users to browse courses, view details of each course, and navigate between different sections in an organized manner responsive to all devices.\n______________________________\nThe platform supports multiple languages, providing interfaces in both Arabic and English through a fully custom system for text management and translation without relying on any external libraries.\n______________________________\nThe platform features a modern and responsive design with attention to animations and visual transitions to enhance the user experience.\nIt includes a real-time interaction system to support live updates within the interface when needed.\nThe platform is built using the latest front-end technologies with performance, security, and future development in mind.\n______________________________\nTechnologies used to build the platform:\nFront-end technologies:\nFramework: Next.js\nProgramming Language: TypeScript\nStyling: Tailwind CSS\nForm Management: @tailwindcss/forms\nAnimations & Transitions: Framer Motion\nSliders & Carousels: Swiper\nRealtime Updates: Pusher\nAuthentication: Clerk\nPayments Integration: Stripe\nAPI Handling: Axios\nCookie Management: cookie-universal\nImage Optimization: Sharp\n______________________________\nThe platform is currently a Front-end only project, prepared for integration with any future Back-end system if needed."
  }
}
