{
  "content": {
    "en": "Flix Tv is a modern web interface designed to simulate the experience of streaming platforms, allowing users to explore movies and series, follow popular content, and organize their preferences within an attractive and smooth interface supporting multiple languages.\n__________________________\nThe platform relies on a direct data source from TMDb to provide realistic and up-to-date content, enabling dynamic display of movies and series with detailed information for each title, such as rating, language, genre, and description.\n__________________________\nThe platform includes a complete and secure authentication system to manage user accounts and ensure a personalized and organized experience for each user.\nIt allows content organization through watchlists and custom tracking states, enabling users to control what they want to watch and easily follow their choices.\nThe platform uses a responsive and flexible design that works efficiently on all devices, with smooth transitions and elegant visual touches to enhance interaction.\nIt relies on smart data management and interactive notifications to improve user experience and smooth navigation.\n__________________________\nTechnologies used to build the platform:\nFront-end technologies:\nFramework: Next.js\nProgramming language: TypeScript\nStyling: Tailwind CSS\nAuthentication: Clerk\nState Management & Data Fetching: @tanstack/react-query\nAPI handling: Axios\nAnimations & Transitions: Framer Motion\nSliders & Carousels: Swiper\nNotifications: Sonner\nImage optimization: Sharp\nUI Components: @radix-ui/react-slot, Lucide React, React Icons\nAnimations: tw-animate-css\n__________________________\nThe platform is a Front-end only project, designed to provide a complete experience simulating movies and series content, with the ability to integrate with any future Back-end.",
    "ar": "Flix Tv هو واجهة ويب حديثة مصممة لمحاكاة تجربة منصات عرض المحتوى السينمائي، حيث تتيح للمستخدم استكشاف الأفلام والمسلسلات ومتابعة الأعمال الشائعة وتنظيم تفضيلاته ضمن واجهة جذابة وسلسة تدعم أكثر من لغة.\n__________________________\nالمنصة تعتمد على مصدر بيانات مباشر من TMDb لتقديم محتوى واقعي وحديث، مما يسمح بعرض الأعمال السينمائية والمسلسلات بشكل ديناميكي مع تفاصيل دقيقة لكل عمل، مثل التقييم، اللغة، التصنيف، والنبذة التعريفية.\n__________________________\nالمنصة تحتوي على نظام مصادقة متكامل وآمن لإدارة حسابات المستخدمين وضمان تجربة شخصية منظمة لكل مستخدم.\nالمنصة توفر إمكانية تنظيم المحتوى من خلال قوائم مشاهدة وحالات متابعة مخصصة، بما يتيح للمستخدم التحكم في ما يريد مشاهدته وتتبع اختياراته بسهولة.\nالمنصة تعتمد على تصميم مرن ومتجاوب يعمل بكفاءة على جميع الأجهزة، مع حركات انتقال ناعمة ولمسات بصرية أنيقة تعزز التفاعل.\nالمنصة تعتمد على إدارة ذكية للبيانات وتنبيهات تفاعلية لتحسين تجربة المستخدم وسلاسة التصفح.\n__________________________\nالتقنيات المستخدمة في بناء المنصة:\nتقنيات (Front-end):\nFramework: Next.js\nلغة البرمجة: TypeScript\nتنسيق الواجهة (Styling): Tailwind CSS\nAuthentication: Clerk\nState Management & Data Fetching: @tanstack/react-query\nالتعامل مع الـ API: Axios\nالحركات والانتقالات: Framer Motion\nSliders وCarousels: Swiper\nNotifications: Sonner\nتحسين الصور: Sharp\nUI Components: @radix-ui/react-slot, Lucide React, React Icons\nAnimations: tw-animate-css\n__________________________\nالمنصة عبارة عن مشروع Front-end فقط، مُصممة لتقديم تجربة متكاملة لمحاكاة محتوى الأفلام والمسلسلات مع إمكانية التكامل مع أي Back-end مستقبلي."
  }
}
