{
  "content": {
    "ar": "موقع واجهة رقمية حديثة مستوحاة من منصات الخدمات المصغرة مثل Fiverr، مصمم لإظهار شكل تجربة المستخدم المثالية وطريقة عرض الخدمات بشكل منظم وجذاب. يعكس التصميم كيفية تصفح الخدمات عبر التصنيفات والبحث، وعرض التفاصيل الأساسية لكل خدمة بشكل واضح، مع التركيز على جماليات الواجهة وسهولة الاستخدام.\n________________________________\nيتميّز الموقع بما يلي:\nواجهة أمامية عصرية ومنظمة تعرض الخدمات بطريقة بصرية جذابة.\nدعم كامل للغتين العربية والإنجليزية، حيث يعمل نظام تعدد اللغات (i18n) بشكل طبيعي.\nتصميم متجاوب يعمل بكفاءة على مختلف الأجهزة والشاشات.\nحركات وانتقالات سلسة لإظهار التفاعلات بشكل واقعي دون وجود وظائف فعلية في الوقت الحالي.\n________________________________\nالتقنيات المستخدمة في بناء التصميم:\nFramework: Next.js\nلغة البرمجة: TypeScript\nتنسيق الواجهة (Styling): Tailwind CSS\nالحركات والانتقالات: Framer Motion\nSliders وCarousels: Swiper\nتعدد اللغات (i18n): next-intl\nتحسين الصور: Sharp\n________________________________\nهذا المشروع يقدّم نموذجًا بصريًا تفاعليًا للواجهة الأمامية فقط، دون أي ميزات عملية حالية، مع إمكانية تطويره لاحقًا ليصبح منصة كاملة.",
    "en": "A modern digital interface website inspired by micro-service platforms like Fiverr, designed to showcase an ideal user experience and organized, attractive service presentation. The design reflects how users browse services via categories and search, displaying essential details for each service clearly, with focus on interface aesthetics and ease of use.\n________________________________\nThe website features:\nA modern and organized front-end displaying services in an attractive visual manner.\nFull support for both Arabic and English, with the i18n system working seamlessly.\nResponsive design that works efficiently across various devices and screens.\nSmooth transitions and animations to display interactions realistically without actual functional features at the moment.\n________________________________\nTechnologies used to build the design:\nFramework: Next.js\nProgramming Language: TypeScript\nStyling: Tailwind CSS\nAnimations & Transitions: Framer Motion\nSliders & Carousels: Swiper\ni18n: next-intl\nImage Optimization: Sharp\n________________________________\nThis project provides an interactive visual front-end only, without any functional features currently, with the possibility to develop it later into a full platform."
  }
}
