{
  "content": {
    "ar": "هذا المشروع هو نموذج تطبيقي لمنصة تسوّق رقمية حديثة يهدف إلى محاكاة تجربة المتاجر الإلكترونية الواقعية، مع التركيز على سرعة التصفح، سلاسة التفاعل، وبناء واجهة استخدام عصرية وقابلة للتوسع.\n__________________________\nالمنصة تعتمد على مصدر بيانات تجريبي (DummyJSON) لتوفير محتوى منتجات واقعي يُستخدم في محاكاة عمليات العرض والبيع والشراء، مما يجعل المشروع مناسبًا لأغراض التطوير، الاختبار، واستعراض القدرات التقنية.\n__________________________\nالمنصة تحتوي على نظام مصادقة متكامل يتيح إنشاء الحسابات، تسجيل الدخول، والتحقق من المستخدمين بطريقة منظمة واحترافية.\nالمنصة توفر نظام عرض منتجات ديناميكي يعتمد على واجهات تفاعلية وسلايدر لعرض المنتجات بشكل جذاب وسلس.\nالمنصة تحتوي على محاكاة لعملية الدفع الإلكتروني من خلال تكامل آمن مع Stripe، بهدف استعراض منطق الدفع دون الاعتماد على نظام تجاري فعلي.\n__________________________\nالمنصة تعتمد على تصميم متجاوب بأسلوب Mobile First يعمل بكفاءة على مختلف أحجام الشاشات، مع الاهتمام بالحركات والانتقالات البصرية لتحسين تجربة المستخدم.\n__________________________\nالمنصة تحتوي على نظام إدارة حالة خفيف ومرن لإدارة البيانات المشتركة داخل التطبيق.\nالمنصة تدعم العروض المؤقتة والعدّادات الزمنية المباشرة لتعزيز التفاعل مع المستخدم.\nالمنصة تعتمد على تحسين تلقائي للصور لتحقيق توازن مثالي بين الجودة والأداء.\nالمنصة تم بناؤها باستخدام مكوّنات واجهة قابلة لإعادة الاستخدام بهوية بصرية حديثة ومنظمة.\n__________________________\nالتقنيات المستخدمة في بناء المنصة:\nتقنيات (Front-end):\nFramework: Next.js\nلغة البرمجة: TypeScript\nتنسيق الواجهة (Styling): Tailwind CSS\nAuthentication: Clerk\nPayments Integration: Stripe\nState Management: Zustand\nالتعامل مع الـ API: Axios\nالحركات والانتقالات: Framer Motion\nSliders وCarousels: Swiper\nCountdown Timers: react-timer-hook\nNotifications: Sonner\nتحسين الصور: Sharp\n__________________________\nالمنصة عبارة عن مشروع Front-end فقط ومُصمم ليكون قاعدة جاهزة للتكامل مع أي Back-end مستقبلي.",
    "en": "This project is an applied model of a modern digital shopping platform aimed at simulating the experience of real e-commerce stores, focusing on browsing speed, smooth interactions, and building a modern and scalable user interface.\n__________________________\nThe platform relies on a dummy data source (DummyJSON) to provide realistic product content used to simulate display, sale, and purchase operations, making the project suitable for development, testing, and showcasing technical capabilities.\n__________________________\nThe platform includes a complete authentication system allowing account creation, login, and user verification in an organized and professional manner.\nIt provides a dynamic product display system with interactive interfaces and sliders for attractive and smooth product presentation.\nThe platform includes a simulated electronic payment process through secure Stripe integration, allowing demonstration of payment logic without relying on an actual commercial system.\n__________________________\nThe platform features a responsive Mobile-First design that works efficiently across different screen sizes, with attention to animations and visual transitions to enhance user experience.\n__________________________\nThe platform includes a lightweight and flexible state management system for handling shared data within the app.\nIt supports limited-time offers and live countdown timers to enhance user interaction.\nIt employs automatic image optimization to achieve an ideal balance between quality and performance.\nThe platform is built using reusable UI components with a modern and organized visual identity.\n__________________________\nTechnologies used to build the platform:\nFront-end technologies:\nFramework: Next.js\nProgramming Language: TypeScript\nStyling: Tailwind CSS\nAuthentication: Clerk\nPayments Integration: Stripe\nState Management: Zustand\nAPI Handling: Axios\nAnimations & Transitions: Framer Motion\nSliders & Carousels: Swiper\nCountdown Timers: react-timer-hook\nNotifications: Sonner\nImage Optimization: Sharp\n__________________________\nThe platform is a Front-end only project, designed to serve as a ready base for integration with any future Back-end."
  }
}
