{
  "content": {
    "ar": "Madad هو نموذج واجهة ويب تفاعلي يعكس الهوية الرقمية لمنصة متخصصة في الخدمات الفنية، حيث يقدّم تصورًا بصريًا متكاملًا لتجربة المستخدم على الواجهة الأمامية فقط دون التطرق للجانب البرمجي الخلفي.\n__________________________\nالمنصة تهدف إلى عرض الخدمات بشكل واضح وجذاب، مع التركيز على تجربة الاستخدام السلسة والجوانب الجمالية للواجهة، مما يتيح استعراضًا احترافيًا أمام العملاء أو المستثمرين.\n__________________________\nالمنصة تحتوي على:\nواجهة أمامية عصرية بتصميم منظم وسلس.\nصفحات مخصصة لعرض الخدمات بأسلوب جذاب وواضح.\nنموذج تواصل مرئي يحاكي تجربة التفاعل مع العملاء.\nتصميم متجاوب يعمل بكفاءة على جميع الشاشات.\nتحسين سرعة التحميل وانسيابية تجربة المستخدم.\nنظام مصادقة وتسجيل دخول متكامل لإدارة دخول المستخدمين بطريقة آمنة.\n__________________________\nالتقنيات المستخدمة في بناء المنصة:\nتقنيات (Front-end):\nFramework: Next.js\nلغة البرمجة: TypeScript\nAuthentication & User Login: Clerk\nالحركات والانتقالات: Framer Motion\nSliders وCarousels: Swiper\nإدارة الحالة: Zustand\nNotifications: Sonner\nتحسين الصور: Sharp\nUI Components: React Icons, React Intersection Observer\n__________________________\nالمنصة عبارة عن مشروع Front-end فقط، مُصممة لتقديم تجربة بصرية احترافية للواجهة أمام العملاء والمستثمرين مع دعم نظام تسجيل دخول آمن للمستخدمين.",
    "en": "Madad is an interactive web interface model reflecting the digital identity of a platform specialized in technical services, providing a complete visual concept for user experience on the front-end only without involving the back-end.\n__________________________\nThe platform aims to present services clearly and attractively, focusing on smooth user experience and interface aesthetics, allowing professional presentation to clients or investors.\n__________________________\nThe platform includes:\nA modern front-end with organized and smooth design.\nDedicated pages to showcase services attractively and clearly.\nA visual contact model simulating customer interaction.\nResponsive design that works efficiently across all screens.\nEnhanced loading speed and smooth user experience.\nA complete authentication and login system to manage user access securely.\n__________________________\nTechnologies used to build the platform:\nFront-end technologies:\nFramework: Next.js\nProgramming Language: TypeScript\nAuthentication & User Login: Clerk\nAnimations & Transitions: Framer Motion\nSliders & Carousels: Swiper\nState Management: Zustand\nNotifications: Sonner\nImage Optimization: Sharp\nUI Components: React Icons, React Intersection Observer\n__________________________\nThe platform is a Front-end only project, designed to provide a professional visual experience for the front-end to clients and investors, with a secure user login system."
  }
}
